if ENV["HOMEBREW_NO_INSTALL_FROM_API"].present?
  tap "homebrew/core"
  tap "homebrew/cask"
end

brew "actionlint"
brew "arduino-cli"
brew "awscli"
brew "bat"
brew "bear"
brew "biber"
brew "binutils"
brew "btop"
brew "ccache"
brew "cloudflare-wrangler"
brew "cloudflared"
brew "cmake"
brew "coreutils"
brew "curl"
brew "diffoscope"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "google-java-format"
brew "graphviz"
brew "hugo"
brew "hyperfine"
brew "icloudpd"
brew "jq"
brew "lima"
brew "lld"
brew "llvm"
brew "make"
brew "mdbook"
brew "mold"
brew "moreutils"
brew "mypy"
brew "ncdu"
brew "ninja"
brew "opentofu"
brew "pandoc"
brew "patchelf"
brew "pkgconf"
brew "qemu"
brew "ripgrep"
brew "ruff"
brew "shellcheck"
brew "shfmt"
brew "smartmontools"
brew "sqlite"
brew "tcpdump"
brew "texlive"
brew "tex-fmt"
brew "tlrc"
brew "tmux"
brew "tree"
brew "trivy"
brew "uv"
brew "vim"
brew "yq"
brew "yt-dlp"

if OS.mac?
  tap "powershell/tap"
  brew "powershell/tap/powershell"

  cask "firefox"
  cask "google-chrome"
  cask "iina"
  cask "iterm2"
  cask "keka"
  cask "notion"
  cask "obs"
  cask "postman"
  cask "raspberry-pi-imager"
  cask "slack"
  cask "steam"
  cask "suspicious-package"
  cask "transmission"
  cask "utm"
  cask "visual-studio-code"
  cask "zoom"

  if Hardware::CPU.arm?
    brew "container"

    cask "virtualbuddy"
  end
end
