if ENV["HOMEBREW_NO_INSTALL_FROM_API"].present?
  tap "homebrew/core"
  tap "homebrew/cask"
end

brew "actionlint"
brew "awscli"
brew "bat"
brew "bear"
brew "biber"
brew "binutils"
brew "btop"
brew "ccache"
brew "cloudflare-wrangler"
brew "cloudflared"
brew "cmake"
brew "coreutils"
brew "curl"
brew "diffoscope"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "google-java-format"
brew "graphviz"
brew "hugo"
brew "hyperfine"
brew "jq"
brew "kubernetes-cli"
brew "lima"
brew "lld"
brew "llvm"
brew "make"
brew "mdbook"
brew "mold"
brew "moreutils"
brew "ncdu"
brew "ninja"
brew "opentofu"
brew "oras"
brew "pandoc"
brew "patchelf"
brew "pkgconf"
brew "poppler"
brew "qemu"
brew "qpdf"
brew "ripgrep"
brew "ruff"
brew "shellcheck"
brew "shfmt"
brew "skopeo"
brew "smartmontools"
brew "sqlite"
brew "tailscale"
brew "tcpdump"
brew "texlive"
brew "tex-fmt"
brew "tlrc"
brew "tmux"
brew "tree"
brew "ty"
brew "uv"
brew "vim"
brew "yq"
brew "yt-dlp"
brew "zizmor"

if OS.mac?
  if Hardware::CPU.arm?
    brew "container"
  end
end

if OS.mac?
  cask "bruno"
  cask "firefox"
  cask "iina"
  cask "iterm2"
  cask "keka"
  cask "suspicious-package"
  cask "visual-studio-code"
end

if OS.mac?
  vscode "13xforever.language-x86-64-assembly"
  vscode "alefragnani.bookmarks"
  vscode "arm.armls"
  vscode "astral-sh.ty"
  vscode "ban.spellright"
  vscode "charliermarsh.ruff"
  vscode "davidanson.vscode-markdownlint"
  vscode "dbaeumer.vscode-eslint"
  vscode "docker.docker"
  vscode "eamodio.gitlens"
  vscode "foxundermoon.shell-format"
  vscode "github.codespaces"
  vscode "github.vscode-github-actions"
  vscode "golang.go"
  vscode "james-yu.latex-workshop"
  vscode "llvm-vs-code-extensions.vscode-clangd"
  vscode "mechatroner.rainbow-csv"
  vscode "ms-python.python"
  vscode "ms-python.vscode-pylance"
  vscode "ms-toolsai.jupyter-renderers"
  vscode "ms-vscode-remote.remote-ssh"
  vscode "ms-vscode-remote.remote-ssh-edit"
  vscode "ms-vscode.cmake-tools"
  vscode "ms-vscode.hexeditor"
  vscode "ms-vscode.live-server"
  vscode "ms-vscode.remote-server"
  vscode "mutantdino.resourcemonitor"
  vscode "opentofu.vscode-opentofu"
  vscode "pkief.material-icon-theme"
  vscode "redhat.java"
  vscode "redhat.vscode-xml"
  vscode "redhat.vscode-yaml"
  vscode "rust-lang.rust-analyzer"
  vscode "shopify.ruby-lsp"
  vscode "sorbet.sorbet-vscode-extension"
  vscode "tamasfe.even-better-toml"
  vscode "timonwong.shellcheck"
  vscode "vscjava.vscode-java-dependency"
  vscode "yzhang.markdown-all-in-one"
  vscode "zhuangtongfa.material-theme"
end

brewfile_local = Pathname.new(__FILE__).dirname/"Brewfile.local"
instance_eval brewfile_local.read if brewfile_local.exist?
